[
    {
        "bookId": 1,
        "bookName": "The Silent Patient",
        "author": "Alex Michaelides",
        "image": "https://i.ibb.co/gZk31mj/silent-patient-cover.jpg",
        "review": "The Silent Patient is a gripping psychological thriller that keeps readers on the edge of their seats. Alex Michaelides crafts a masterful tale of suspense and intrigue, revolving around the enigmatic Alicia Berenson, who hasn't spoken since allegedly murdering her husband. As psychotherapist Theo Faber delves into Alicia's past, the narrative unfolds with twists and turns, keeping readers guessing until the shocking conclusion. Michaelides skillfully explores themes of trauma, obsession, and the complexity of the human mind. With its tightly plotted storyline and compelling characters,The Silent Patient is a riveting page-turner that leaves a lasting impression",
        "totalPages": 336,
        "rating": 4.5,
        "category": "Mystery",
        "tags": [
            "Suspense",
            "Psychological"
        ],
        "publisher": "Celadon Books",
        "yearOfPublishing": 2019
    },
    {
        "bookId": 2,
        "bookName": "The Night Circus",
        "author": "Erin Morgenstern",
        "image": "https://i.ibb.co/MVJMYPN/Night-Circus.jpg",
        "review": "The Night Circus mesmerizes with its enchanting tale of a mysterious competition between two young illusionists, set in a fantastical world of magic and wonder. Erin Morgenstern's prose weaves a spellbinding narrative, where the circus becomes a character in itself, vividly brought to life with its black-and-white tents and breathtaking spectacles. The romance between Celia and Marco adds depth to the intricate plot, while supporting characters add layers of intrigue. Morgenstern's exquisite storytelling and imaginative world-building create an immersive experience that lingers long after the final page.The Night Circus is a captivating journey into a realm where dreams and reality blur seamlessly. ",
        "totalPages": 400,
        "rating": 4.7,
        "category": "Fantasy",
        "tags": [
            "Magic",
            "Romance"
        ],
        "publisher": "Doubleday",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 3,
        "bookName": "Educated",
        "author": "Tara Westover",
        "image": "https://i.ibb.co/R0k4JgQ/educated.jpg",
        "review": "Tara Westover's 'Educated' is a poignant memoir of resilience and self-discovery. Raised in a strict, isolated household by survivalist parents in rural Idaho, Westover recounts her journey of breaking free from her upbringing to pursue education. Her narrative is both harrowing and inspiring, illustrating the power of knowledge to transform lives. With eloquent prose, Westover navigates themes of family, identity, and the pursuit of truth. 'Educated' is a compelling testament to the human spirit's capacity for growth and reinvention, leaving readers moved and contemplative long after turning the final page",
        "totalPages": 352,
        "rating": 4.6,
        "category": "Biography",
        "tags": [
            "Memoir",
            "Inspiration"
        ],
        "publisher": "Random House",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 4,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co/kQJjCHz/The-Great-Gatsby-Cover-1925-Retouched.jpg",
        "review": "The Great Gatsby by F. Scott Fitzgerald is a timeless masterpiece, capturing the essence of the Jazz Age with its vivid portrayal of wealth, love, and disillusionment. Set in the opulent world of 1920s Long Island, the novel follows Jay Gatsby's pursuit of the American Dream and his obsessive love for Daisy Buchanan. Fitzgerald's exquisite prose and complex characters offer a profound exploration of social class, morality, and the emptiness of materialism. With its haunting themes and evocative imagery, The Great Gatsby remains a poignant reflection on the fragility of human aspirations and the allure of the unattainable",
        "totalPages": 180,
        "rating": 4.8,
        "category": "Classic",
        "tags": [
            "American Literature",
            "Romance"
        ],
        "publisher": "Scribner",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 5,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.ibb.co/fHY8hJT/1984.jpg",
        "review": "1984 by George Orwell is a chilling dystopian novel that remains alarmingly relevant today. Set in a totalitarian society ruled by the oppressive Party, protagonist Winston Smith rebels against surveillance and propaganda, only to face the consequences of his defiance. Orwell's exploration of power, truth, and the erosion of individual freedom is hauntingly prescient. The novel's themes of surveillance and government control resonate deeply in an era of increasing digital monitoring and censorship. With its stark warning against authoritarianism,1984 serves as a timeless reminder of the fragility of democracy and the importance of safeguarding civil liberties.",
        "totalPages": 328,
        "rating": 4.9,
        "category": "Dystopian",
        "tags": [
            "Politics",
            "Social Commentary"
        ],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 6,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://i.ibb.co/Km5kfrb/Alchemist.jpg",
        "review": "The Alchemist by Paulo Coelho is a captivating tale of self-discovery and following one's dreams. Through the journey of Santiago, a shepherd boy, Coelho weaves a narrative rich in symbolism and wisdom. Santiago's quest for his Personal Legend unfolds against the backdrop of the desert, where he encounters spiritual teachings and encounters that shape his understanding of life's purpose. Coelho's prose is simple yet profound, offering readers insights into the universal pursuit of fulfillment and happiness.The Alchemist inspires with its message of courage, perseverance, and the transformative power of listening to one's heart",
        "totalPages": 208,
        "rating": 4.7,
        "category": "Fiction",
        "tags": [
            "Philosophical",
            "Spirituality"
        ],
        "publisher": "HarperCollins",
        "yearOfPublishing": 1988
    },
    {
        "bookId": 7,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.ibb.co/HTmZTZc/The-Catcher-in-the-Rye.webp",
        "review": "The Catcher in the Rye by J.D. Salinger is a timeless coming-of-age novel that captures the angst and alienation of adolescence. Narrated by the rebellious Holden Caulfield, the story follows his escapades in New York City after being expelled from prep school. Salinger's portrayal of Holden's existential crisis resonates with readers, exploring themes of identity, authenticity, and the search for meaning in a superficial world. Through Holden's cynical yet vulnerable voice, Salinger crafts a poignant reflection on the challenges of growing up and the struggle to connect with others. The Catcher in the Rye remains a classic exploration of teenage rebellion and disillusionment.",
        "totalPages": 224,
        "rating": 4.6,
        "category": "Classic",
        "tags": [
            "Literary Fiction",
            "Teenage Angst"
        ],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 8,
        "bookName": "Harry Potter",
        "author": "J.K. Rowling",
        "image": "https://i.ibb.co/Z2RKWqN/Harry-Potter-and-the-Philosopher-s-Stone.jpg",
        "review": "Harry Potter and the Philosopher's Stone by J.K. Rowling is a captivating introduction to the magical world of Hogwarts. Through Harry's journey from a mundane existence with the Dursleys to discovering his true identity as a wizard, Rowling enchants readers with her imaginative storytelling and vibrant characters. The novel brims with themes of friendship, courage, and the battle between good and evil. Rowling's ability to weave a rich tapestry of magic and adventure makes this book a timeless classic for readers of all ages. Harry Potter and the Philosopher's Stone is a spellbinding start to an unforgettable literary saga.",
        "totalPages": 320,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": [
            "Magic",
            "Adventure"
        ],
        "publisher": "Bloomsbury",
        "yearOfPublishing": 1997
    },
    {
        "bookId": 9,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/31C9VGB/To-Kill-a-Mockingbird.webp",
        "review": "To Kill a Mockingbird by Harper Lee is a timeless masterpiece that confronts societal injustice and moral courage. Set in the racially charged atmosphere of 1930s Alabama, the novel follows young Scout Finch's coming-of-age journey as she navigates the complexities of prejudice and empathy. Through the trial of Tom Robinson, falsely accused of assaulting a white woman, Lee crafts a searing indictment of racism and intolerance. With its profound themes of empathy, integrity, and the loss of innocence, To Kill a Mockingbird remains a poignant reminder of the importance of standing up for what is right in the face of adversity.",
        "totalPages": 336,
        "rating": 4.7,
        "category": "Classic",
        "tags": [
            "Southern Literature",
            "Social Issues"
        ],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 10,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/3cVT8s8/The-Hobbit.jpg",
        "review": "The Hobbit by J.R.R. Tolkien is a timeless adventure that transports readers to the enchanting world of Middle-earth. Bilbo Baggins, a reluctant hero, embarks on a quest to reclaim the treasure guarded by the dragon Smaug. Tolkien's richly imagined universe is brought to life through vivid descriptions and captivating characters, from the wise wizard Gandalf to the endearing hobbits. As Bilbo encounters trolls, elves, and goblins along his journey, themes of courage, friendship, and the power of the ordinary emerge. With its epic scope and heartfelt storytelling,The Hobbit is a beloved classic that continues to inspire readers of all ages.",
        "totalPages": 310,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": [
            "Adventure",
            "Epic Fantasy"
        ],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 11,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.ibb.co/Mfq8wfK/Pride-and-Prejudice.jpg",
        "review": "Pride and Prejudice by Jane Austen is a timeless masterpiece of wit, romance, and social commentary. Set in Regency-era England, the novel follows the spirited Elizabeth Bennet as she navigates the intricacies of love and class in a society governed by strict conventions. Austen's sharp social observations and sparkling dialogue illuminate themes of marriage, manners, and personal integrity. Through the tumultuous courtship of Elizabeth and Mr. Darcy, Austen crafts a story that transcends its time, resonating with readers for generations. Pride and Prejudice remains a beloved classic, celebrated for its enduring charm, memorable characters, and timeless exploration of human nature.",
        "totalPages": 432,
        "rating": 4.7,
        "category": "Classic",
        "tags": [
            "Romance",
            "Regency Era"
        ],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 12,
        "bookName": "The Road",
        "author": "Cormac McCarthy",
        "image": "https://i.ibb.co/fqQvg6n/The-Road.jpg",
        "review": "The Road by Cormac McCarthy is a haunting and bleak masterpiece that explores the depths of human resilience amidst a post-apocalyptic world. Set in a desolate landscape ravaged by an unspecified catastrophe, it follows a father and son's journey towards survival and hope. McCarthy's sparse prose mirrors the barren landscape, yet his writing is deeply evocative, capturing the raw emotions of fear, despair, and love. Through vivid imagery and profound themes of morality and existentialism, The Road leaves a lasting impact, prompting reflection on the essence of humanity and the endurance of the human spirit in the face of utter devastation.",
        "totalPages": 287,
        "rating": 4.5,
        "category": "Fiction",
        "tags": [
            "Dystopian",
            "Father-Son Relationship"
        ],
        "publisher": "Alfred A. Knopf",
        "yearOfPublishing": 2006
    }
]